#### Check! Terraform Show Plans 🖌`
<details><summary>Dev Show Plan</summary>

```

terraform
module.bastion.data.aws_iam_policy.this: Reading...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01e419b9d6aa7ca58]
module.bastion.data.aws_ssm_parameter.this: Reading...
module.bastion.data.aws_iam_policy.this: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.bastion.data.aws_ssm_parameter.this: Read complete after 0s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
module.vpc.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-00063dab25659c5c6]
module.vpc.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-01e562768647a5774]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-05a3f2cae119ba61f]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09b5781d83cf429ad]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08a9a92289e8979e1]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00d992d25e2ca6d6d]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06d476da1ecb4fd74]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-042b9e97d231032cb]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ecafa3f52072e877]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d17b6aac3c0b3605]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-057ab3c8c85f08047]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0496de07da9d3e798]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0087daec68da1c8bc]
module.vpc.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dev-vpc]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-01d9e12937f4efcc5]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02fcb4c939da85f6b]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05d679edc05335b0d]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fc77ae28083a2992]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-042b9e97d231032cb1080289494]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0416a813a35c5efe8]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03336d04e4a93c512]
module.vpc.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0bbf7950f0b932d24]
module.vpc.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-05632975bffd9bce0]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-094db10f8aebf9254]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-091e259309b6fb75f]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0087daec68da1c8bc1080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0496de07da9d3e7981080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bastion.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "dev-iam-instance-profile-bastion"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "dev-iam-role-bastion"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.bastion.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-iam-role-bastion"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.bastion.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "dev-iam-role-bastion"
    }

  # module.bastion.aws_instance.this will be created
  + resource "aws_instance" "this" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "dev-iam-instance-profile-bastion"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0ecafa3f52072e877"
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "dev-bastion"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "dev-bastion"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.bastion.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "from rivate"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "dev-sg-bastion"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-bastion"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "dev-sg-bastion"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-01e419b9d6aa7ca58"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Ixy-194, Action: `pull_request`*